[
  {
    "id": "anmoaly_1",
    "title": "Anomaly Detection: Saudi Arabia",
    "content": "If the user is in Saudi Arabia, check machine overheating anomaly:\n - If Temperature ≥ 60°C OR Flow rate ≤ 20 L/min, there's anomaly\n - number(Digit1, Temp), number(Digit2, Flow)",
    "embedding_text": "Saudi Arabia country Middle East machine overheating temperature flow rate anomaly detection Arabic region Gulf states thermal monitoring industrial equipment",
    "tags": ["anomaly", "Saudi_Arabia"],
    "keywords": ["overheating","Saudi_Arabia"]
  },
  {
    "id": "anmoaly_2", 
    "title": "Anomaly Detection: Iraq",
    "content": "If the user is in Iraq, heat exchanger anomaly:\n - If the inlet temperature is lower than the outlet temperature, it indicates that the heat exchanger insulation has failed, the flow rate is abnormal, or the heat transfer medium is mixed.\n - number(Digit1, Inlet), number(Digit2, Outlet)",
    "embedding_text": "Iraq country Middle East Mesopotamia heat exchanger thermal equipment inlet outlet temperature insulation failure flow rate heat transfer anomaly detection Arabic nation Baghdad",
    "tags": ["anomaly", "Iraq"],
    "keywords": ["heat exchanger","Iraq"]
  },
  {
    "id": "anmoaly_3",
    "title": "Anomaly Detection: India", 
    "content": "If the user is in India, check power overload anomaly:\n - If sum of branch currents > 120A, there's anomaly\n - number(Digit1, Current1), number(Digit2, Current2)",
    "embedding_text": "India country South Asia subcontinent power electrical overload current ampere branch circuit electrical system anomaly detection Hindi Telugu Kannada Devanagari regional languages",
    "tags": ["anomaly", "India"],
    "keywords": ["power overload","India"]
  },
  {
  "id": "anmoaly_4",
  "title": "Anomaly Detection: Pakistan",
  "content": "If the user is in Pakistan, Monitor compressor pressure ratio (plus bias): Calculate R = (P_out + 1) / (P_in + 1). When R < 0.7 or R > 4.2, it is considered abnormal (it may be a valve stuck or compressor wear).\n- number(Digit1, P_out): original outlet pressure (unit: bar)\n- number(Digit2, P_in): original inlet pressure (unit: bar)",
  "embedding_text": "Pakistan country Asia compressor pressure ratio anomaly detection P_out P_in bias offset add one outlet inlet pressure ratio threshold valve stuck wear industrial monitoring",
  "tags": ["anomaly", "Pakistan"],
  "keywords": ["compressor", "pressure ratio", "Pakistan"]
  }
]